---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoRebarSelected
source: html/f63f04d7-f98b-e1e6-60af-4e739043ec50.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoRebarSelected Property

At least one Rebar should be selected.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRebarSelected { get; }
```